In [1]:
# Pandas - built on top of NumPy, fast analysis and data cleaning and preparation
# has built-in visualization features
#
# Pandas in general is used for financial time series data/economics data (it has a lot of built in helpers to handle financial data).
# Numpy is a fast way to handle large arrays multidimensional arrays for scientific computing (scipy also helps). It also has easy handling for what are called sparse arrays (large arrays with very little data in them).
# One of key advantages of numpy is the C bindings that allow for massive speeds ups in large array computation along with some built in functions for things like linear algebra/ signal processing capabilities.
# Both packages address some of the deficiencies that were identified with the existing built-in data types with python. As a general rule of thumb, with incomplete real world data (NaNs, outliers, etc), you will end up needing to write all types of functions that address these issues; with the above packages you can build on the work of others. If your program is generating the data for your data type internally, you can probably use the more simplistic native data structures (not just python dictionaries).
# See the post by the author of Pandas for some comparison
# https://stackoverflow.com/questions/45285743/when-to-use-pandas-series-numpy-ndarrays-or-simply-python-dictionaries

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']

In [4]:
data = [10, 20, 30]

In [5]:
arr = np.array(data)

In [6]:
pd.Series(data=data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series({'a': 100})

a    100
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1, 2, 3, 4], ['US', 'DE', 'JP', 'GB'])

In [14]:
ser2 = pd.Series([1, 2, 3, 4], ['US', 'DE', 'IT', 'GB'])

In [15]:
ser1

US    1
DE    2
JP    3
GB    4
dtype: int64

In [16]:
ser2

US    1
DE    2
IT    3
GB    4
dtype: int64

In [17]:
ser3 = pd.Series(data=labels)

In [18]:
ser3

0    a
1    b
2    c
dtype: object

In [19]:
ser2['US']

1

In [21]:
ser2['IT']

3

In [22]:
ser1+ser2

DE    4.0
GB    8.0
IT    NaN
JP    NaN
US    2.0
dtype: float64

In [107]:
np.random.randn(101)

array([-1.24399561,  0.35571498, -0.33063194, -0.28018348, -0.58014387,
       -0.48511945, -0.18272893,  1.35281001,  0.69264627,  1.35156846,
       -0.64449471, -0.89130788,  2.01621282, -0.45793199,  1.28968016,
       -0.27099468, -0.1363024 ,  1.26682438,  0.10173224,  0.64749973,
        0.00912987,  0.19209709,  0.35698848,  0.05434253, -0.13019733,
       -0.13105451, -1.84118168, -0.27455873,  0.08958249, -1.23879801,
       -0.43881434,  0.22583425, -0.91973741, -1.20987228, -1.40328564,
       -0.54970704, -2.3042109 , -0.99347818,  0.25452927,  0.33790349,
        0.66839329,  1.08340763, -1.10957741,  1.15517465, -0.90702865,
       -1.20253272, -0.13551461,  2.55452363,  0.43672584,  2.33510286,
       -0.52859703,  1.6381786 , -0.04468663, -2.10118824, -0.13609539,
        1.00576433,  1.6779972 ,  0.26007556,  1.0824661 , -0.24533741,
       -1.0133488 , -1.14542513, -0.92440909,  0.15441855, -0.03335004,
       -0.14535464,  0.4323034 ,  0.70544727,  0.59566198,  0.0247505 ,
        0.8712036 , -0.44086947,  0.45830708,  0.21829366, -0.07944885,
       -0.9467089 ,  2.39923564, -0.23773145, -0.65983062, -0.78273044,
       -0.3625305 , -1.79455488, -1.02767534,  0.23679726, -0.8182195 ,
       -0.79595474,  1.90126748,  0.61658599,  1.52885635,  0.66952485,
       -0.8632024 , -1.25785608,  0.43453907,  0.92169854,  0.68897706,
       -1.01893951, -0.80720946, -0.25603663,  2.0719069 ,  0.79541963,
       -1.05065506])

In [108]:
df = pd.DataFrame(np.random.randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [109]:
df

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [110]:
df['W']

A   -0.554279
B   -1.437945
C   -1.856308
D    1.791318
E    0.253251
Name: W, dtype: float64

In [111]:
type(df['W'])

pandas.core.series.Series

In [112]:
df['W']

A   -0.554279
B   -1.437945
C   -1.856308
D    1.791318
E    0.253251
Name: W, dtype: float64

In [113]:
df[['W', 'Z']]

          W         Z
A -0.554279  2.352196
B -1.437945  0.646756
C -1.856308  1.320429
D  1.791318 -1.847627
E  0.253251 -1.222667

In [114]:
df['xyz'] = df['W'] + df['Y']

In [115]:
df

          W         X         Y         Z       xyz
A -0.554279  0.197422  0.718854  2.352196  0.164575
B -1.437945 -0.098973  0.060330  0.646756 -1.377615
C -1.856308  0.540444  1.010274  1.320429 -0.846034
D  1.791318  0.281862  1.141203 -1.847627  2.932521
E  0.253251  2.131135 -1.391308 -1.222667 -1.138057

In [116]:
df.drop('xyz', axis=1, inplace=True)

In [117]:
df

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [118]:
df.drop('C')

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [119]:
df.shape

(5, 4)

In [120]:
df

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [121]:
df.loc['A']

W   -0.554279
X    0.197422
Y    0.718854
Z    2.352196
Name: A, dtype: float64

In [122]:
df.iloc[2]

W   -1.856308
X    0.540444
Y    1.010274
Z    1.320429
Name: C, dtype: float64

In [123]:
df.loc[:'C',]

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429

In [124]:
df > 0

       W      X      Y      Z
A  False   True   True   True
B  False  False   True   True
C  False   True   True   True
D   True   True   True  False
E   True   True  False  False

In [125]:
df[df>0]

          W         X         Y         Z
A       NaN  0.197422  0.718854  2.352196
B       NaN       NaN  0.060330  0.646756
C       NaN  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203       NaN
E  0.253251  2.131135       NaN       NaN

In [126]:
df * df>0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [127]:
df['W'] > 0

A    False
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [128]:
resultdf = df[df['W'] > 0]

In [129]:
resultdf

          W         X         Y         Z
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [130]:
resultdf['X']

D    0.281862
E    2.131135
Name: X, dtype: float64

In [131]:
df[df['W']>0]

          W         X         Y         Z
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [132]:
df[df['W']>0]['X']

D    0.281862
E    2.131135
Name: X, dtype: float64

In [133]:
df[(df['W']>0) | (df['X'] > 0 )]

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [134]:
df[(df['X']>0) & (df['Z'] > 0 )]

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
C -1.856308  0.540444  1.010274  1.320429

In [135]:
df

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [136]:
df.reset_index

<bound method DataFrame.reset_index of           W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667>

In [137]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.554279  0.197422  0.718854  2.352196
1     B -1.437945 -0.098973  0.060330  0.646756
2     C -1.856308  0.540444  1.010274  1.320429
3     D  1.791318  0.281862  1.141203 -1.847627
4     E  0.253251  2.131135 -1.391308 -1.222667

In [138]:
newin = 'CA NY WY OR CO'.split()

In [139]:
newin

['CA', 'NY', 'WY', 'OR', 'CO']

In [140]:
df['States'] = newin

In [141]:
df

          W         X         Y         Z States
A -0.554279  0.197422  0.718854  2.352196     CA
B -1.437945 -0.098973  0.060330  0.646756     NY
C -1.856308  0.540444  1.010274  1.320429     WY
D  1.791318  0.281862  1.141203 -1.847627     OR
E  0.253251  2.131135 -1.391308 -1.222667     CO

In [142]:
a = ['A', 'B', 'A', 'B']

In [143]:
b = [1, 2, 3, 4]

In [144]:
zip(a, b)

In [145]:
list(zip(a, b))

[('A', 1), ('B', 2), ('A', 3), ('B', 4)]

In [146]:
h = list(zip(a, b))

In [147]:
h

[('A', 1), ('B', 2), ('A', 3), ('B', 4)]

In [148]:
h = pd.MultiIndex.from_tuples(h)

In [149]:
h

MultiIndex([('A', 1),
            ('B', 2),
            ('A', 3),
            ('B', 4)],
           )

In [150]:
df

          W         X         Y         Z States
A -0.554279  0.197422  0.718854  2.352196     CA
B -1.437945 -0.098973  0.060330  0.646756     NY
C -1.856308  0.540444  1.010274  1.320429     WY
D  1.791318  0.281862  1.141203 -1.847627     OR
E  0.253251  2.131135 -1.391308 -1.222667     CO

In [151]:
df.drop('States', axis=1, inplace=True)

In [152]:
df

          W         X         Y         Z
A -0.554279  0.197422  0.718854  2.352196
B -1.437945 -0.098973  0.060330  0.646756
C -1.856308  0.540444  1.010274  1.320429
D  1.791318  0.281862  1.141203 -1.847627
E  0.253251  2.131135 -1.391308 -1.222667

In [153]:
df2 = pd.DataFrame(np.random.randn(4, 2), h, ['C1', 'C2'])

In [154]:
df2

           C1        C2
A 1 -0.372568 -0.008119
B 2  1.639539 -0.578863
A 3 -1.270254 -0.103638
B 4  0.133505  2.388201

In [157]:
df.index.names = ['Groups']

In [158]:
df

               W         X         Y         Z
Groups
A      -0.554279  0.197422  0.718854  2.352196
B      -1.437945 -0.098973  0.060330  0.646756
C      -1.856308  0.540444  1.010274  1.320429
D       1.791318  0.281862  1.141203 -1.847627
E       0.253251  2.131135 -1.391308 -1.222667

In [159]:
df.loc['D'].loc['Z']

-1.847627283726736

In [160]:
df.xs('D')

W    1.791318
X    0.281862
Y    1.141203
Z   -1.847627
Name: D, dtype: float64

In [168]:
d = {'A':[1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C':[1, 2, 3]}

In [169]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [170]:
df = pd.DataFrame(d)

In [171]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [172]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [173]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [175]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [177]:
df.fillna(value=1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [178]:
df['A'].fillna(value=1)

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [179]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [180]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [181]:
df.fillna(value=1, inplace=True)

In [182]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [185]:
byA = df.groupby('A')

In [187]:
byA.mean()

       B    C
A
1.0  3.0  2.0
2.0  1.0  2.0

In [189]:
byA.sum()

       B  C
A
1.0  6.0  4
2.0  1.0  2

In [190]:
byA.count()

     B  C
A
1.0  2  2
2.0  1  1

In [191]:
byA.max()

       B  C
A
1.0  5.0  3
2.0  1.0  2

In [192]:
byA.describe()

        B                                             C                      \
    count mean       std  min  25%  50%  75%  max count mean       std  min
A
1.0   2.0  3.0  2.828427  1.0  2.0  3.0  4.0  5.0   2.0  2.0  1.414214  1.0
2.0   1.0  1.0       NaN  1.0  1.0  1.0  1.0  1.0   1.0  2.0       NaN  2.0


     25%  50%  75%  max
A
1.0  1.5  2.0  2.5  3.0
2.0  2.0  2.0  2.0  2.0

In [194]:
df = pd.DataFrame(np.random.randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [195]:
df

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
E  0.349288 -0.141604 -0.838854 -0.056599

In [196]:
df2 = pd.DataFrame(np.random.randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [197]:
df

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
E  0.349288 -0.141604 -0.838854 -0.056599

In [198]:
pd.concat([df, df2])

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
E  0.349288 -0.141604 -0.838854 -0.056599
A -0.561091 -0.739650 -1.082702  0.106267
B -0.154456  0.541494 -0.517973 -0.140927
C  0.472263  1.872290 -0.731782 -2.162719
D -1.632644  0.858230  1.731828  0.207172
E  0.250205 -0.496750  0.763961 -1.557755

In [200]:
pd.concat([df, df2], axis=1)

,W,X,Y,Z,W,X,Y,Z
A,0.483996,-0.571073,-0.190412,-0.722961,-0.561091,-0.739650,-1.082702,0.106267
B,0.634789,1.293063,1.003759,0.157841,-0.154456,0.541494,-0.517973,-0.140927
C,0.105264,-1.196964,0.724701,0.356162,0.472263,1.872290,-0.731782,-2.162719
D,-1.145572,-0.743307,-1.178277,-2.702216,-1.632644,0.858230,1.731828,0.207172
E,0.349288,-0.141604,-0.838854,-0.056599,0.250205,-0.496750,0.763961,-1.557755

In [205]:
pd.merge(df, df, how='inner', on=['X'])

        W_x         X       Y_x       Z_x       W_y       Y_y       Z_y
0  0.483996 -0.571073 -0.190412 -0.722961  0.483996 -0.190412 -0.722961
1  0.634789  1.293063  1.003759  0.157841  0.634789  1.003759  0.157841
2  0.105264 -1.196964  0.724701  0.356162  0.105264  0.724701  0.356162
3 -1.145572 -0.743307 -1.178277 -2.702216 -1.145572 -1.178277 -2.702216
4  0.349288 -0.141604 -0.838854 -0.056599  0.349288 -0.838854 -0.056599

In [208]:
df

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
E  0.349288 -0.141604 -0.838854 -0.056599

In [209]:
df + 100

            W           X           Y           Z
A  100.483996   99.428927   99.809588   99.277039
B  100.634789  101.293063  101.003759  100.157841
C  100.105264   98.803036  100.724701  100.356162
D   98.854428   99.256693   98.821723   97.297784
E  100.349288   99.858396   99.161146   99.943401

In [212]:
df['W'].unique()

array([ 0.48399603,  0.63478853,  0.10526356, -1.14557191,  0.34928819])

In [213]:
df['W'].nunique()

5

In [214]:
df['W'].value_counts()

 0.483996    1
 0.634789    1
 0.105264    1
-1.145572    1
 0.349288    1
Name: W, dtype: int64

In [217]:
df[df['W'] > 0.25]

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
E  0.349288 -0.141604 -0.838854 -0.056599

In [218]:
def times2(x):
    return x*2

In [220]:
df['W'].apply(times2)

A    0.967992
B    1.269577
C    0.210527
D   -2.291144
E    0.698576
Name: W, dtype: float64

In [223]:
df['W'].apply(lambda x: x*2)

A    0.967992
B    1.269577
C    0.210527
D   -2.291144
E    0.698576
Name: W, dtype: float64

In [224]:
df

          W         X         Y         Z
A  0.483996 -0.571073 -0.190412 -0.722961
B  0.634789  1.293063  1.003759  0.157841
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
E  0.349288 -0.141604 -0.838854 -0.056599

In [225]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [227]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [228]:
df.sort_values('X')

          W         X         Y         Z
C  0.105264 -1.196964  0.724701  0.356162
D -1.145572 -0.743307 -1.178277 -2.702216
A  0.483996 -0.571073 -0.190412 -0.722961
E  0.349288 -0.141604 -0.838854 -0.056599
B  0.634789  1.293063  1.003759  0.157841

In [230]:
df.sort_values('A', axis=1)

          Z         X         Y         W
A -0.722961 -0.571073 -0.190412  0.483996
B  0.157841  1.293063  1.003759  0.634789
C  0.356162 -1.196964  0.724701  0.105264
D -2.702216 -0.743307 -1.178277 -1.145572
E -0.056599 -0.141604 -0.838854  0.349288

In [232]:
df.isnull()

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [237]:
df.pivot_table(values='Z', index=['W', 'X'], columns =['Y'])

Y                    -1.178277  -0.838854  -0.190412   0.724701   1.003759
W         X
-1.145572 -0.743307  -2.702216        NaN        NaN        NaN        NaN
 0.105264 -1.196964        NaN        NaN        NaN   0.356162        NaN
 0.349288 -0.141604        NaN  -0.056599        NaN        NaN        NaN
 0.483996 -0.571073        NaN        NaN  -0.722961        NaN        NaN
 0.634789  1.293063        NaN        NaN        NaN        NaN   0.157841

In [239]:
pd.read_csv('data/Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [240]:
df = pd.read_csv('data/Salaries.csv')

In [243]:
df.to_csv('data/output-test.csv', index=False)

In [245]:
cities = pd.read_html('https://en.wikipedia.org/wiki/List_of_largest_cities')

In [247]:
cities[1]

        City[a]        Country UN 2018 population estimates[b]  \
        City[a]        Country UN 2018 population estimates[b]
0           NaN            NaN                             NaN
1         Tokyo          Japan                      37468000.0
2         Delhi          India                      28514000.0
3      Shanghai          China                      25582000.0
4     So Paulo         Brazil                      21650000.0
..          ...            ...                             ...
77   Washington  United States                       5207000.0
78       Yangon        Myanmar                       5157000.0
79   Alexandria          Egypt                       5086000.0
80        Jinan          China                       5052000.0
81  Guadalajara         Mexico                       5023000.0

           City proper[c]             \
               Definition Population
0                     NaN        NaN
1   Metropolis prefecture   13515271
2            Capital City   16753235
3            Municipality   24870895
4            Municipality   12252023
..                    ...        ...
77       Federal district     702455
78                   City
79      Urban governorate
80  City (sub-provincial)    8700000
81           Municipality    1385621

                                                                            \
   Area .mw-parser-output .nobold{font-weight:normal}(km2)  Density (/km2)
0                                                 NaN                  NaN
1                                                2191           6,169 [13]
2                                                1484          11,289 [15]
3                                                6341       3,922 [17][18]
4                                                1521           8,055 [19]
..                                                ...                  ...
77                                                177           3,969 [29]
78
79
80                                              10244                  849
81                                                151           9,176 [21]

   Urban area[8]                           Metropolitan area[d]             \
      Population Area (km2) Density (/km2)           Population Area (km2)
0            NaN        NaN            NaN                  NaN        NaN
1       37732000       8231      4,584 [e]             37274000      13452
2       32226000       2344     13,748 [f]             29000000       3483
3       24073000       4333      5,556 [g]
4       23086000       3649      6,327 [h]             21734682       7947
..           ...        ...            ...                  ...        ...
77       7631000       5501      1,387 [s]              6263245      17009
78       6874000        666          10321
79       4712000        293          16082
80       4017000        932           4310
81       5525000        816           6771              5286642       3560


   Density (/km2)
0             NaN
1      2,771 [14]
2      8,326 [16]
3
4      2,735 [20]
..            ...
77       368 [94]
78
79
80
81           1485

[82 rows x 13 columns]